Revit 2027 API
BuiltInFailures.StairRampFailures.AntiparallelRampRisersError Property
 Riser lines are parallel but not collinear. Can't build Run between these Risers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AntiparallelRampRisersError { get; }
Public Shared ReadOnly Property AntiparallelRampRisersError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AntiparallelRampRisersError {
	FailureDefinitionId^ get ();
}
static member AntiparallelRampRisersError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace